zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_PKC.h
#define PKC_PKC_VERSION_SBX3AVAIL_MASK           (0x800U)
#define PKC_PKC_VERSION_SBX3AVAIL_SHIFT          (11U)
/*! sbx3avail - SBX3 operation is available */
#define PKC_PKC_VERSION_SBX3AVAIL(x)             (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_SBX3AVAIL_SHIFT)) & PKC_PKC_VERSION_SBX3AVAIL_MASK)

#define PKC_PKC_VERSION_MCRECONF_SIZE_MASK       (0xFF000U)
#define PKC_PKC_VERSION_MCRECONF_SIZE_SHIFT      (12U)
/*! mcreconf_size - Size of reconfigurable MC table in bytes */
#define PKC_PKC_VERSION_MCRECONF_SIZE(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_MCRECONF_SIZE_SHIFT)) & PKC_PKC_VERSION_MCRECONF_SIZE_MASK)

#define PKC_PKC_VERSION_RESERVED31_MASK          (0xFFF00000U)
#define PKC_PKC_VERSION_RESERVED31_SHIFT         (20U)
/*! reserved31 - reserved */
#define PKC_PKC_VERSION_RESERVED31(x)            (((uint32_t)(((uint32_t)(x)) << PKC_PKC_VERSION_RESERVED31_SHIFT)) & PKC_PKC_VERSION_RESERVED31_MASK)
/*! @} */

/*! @name PKC_SOFT_RST - Software reset */
/*! @{ */

#define PKC_PKC_SOFT_RST_SOFT_RST_MASK           (0x1U)
#define PKC_PKC_SOFT_RST_SOFT_RST_SHIFT          (0U)
/*! soft_rst - Write 1 to reset module (0 has no effect). All running and pending PKC calculation
 *    are stopped. All PKC SFRs are reset except PKC_ACCESS_ERR.
 */
#define PKC_PKC_SOFT_RST_SOFT_RST(x)             (((uint32_t)(((uint32_t)(x)) << PKC_PKC_SOFT_RST_SOFT_RST_SHIFT)) & PKC_PKC_SOFT_RST_SOFT_RST_MASK)

#define PKC_PKC_SOFT_RST_RESERVED31_MASK         (0xFFFFFFFEU)
#define PKC_PKC_SOFT_RST_RESERVED31_SHIFT        (1U)
/*! reserved31 - reserved */
#define PKC_PKC_SOFT_RST_RESERVED31(x)           (((uint32_t)(((uint32_t)(x)) << PKC_PKC_SOFT_RST_RESERVED31_SHIFT)) & PKC_PKC_SOFT_RST_RESERVED31_MASK)
/*! @} */

/*! @name PKC_ACCESS_ERR - Access Error */
/*! @{ */

#define PKC_PKC_ACCESS_ERR_APB_NOTAV_MASK        (0x1U)
#define PKC_PKC_ACCESS_ERR_APB_NOTAV_SHIFT       (0U)
/*! apb_notav - APB Error: address not available */
#define PKC_PKC_ACCESS_ERR_APB_NOTAV(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_APB_NOTAV_SHIFT)) & PKC_PKC_ACCESS_ERR_APB_NOTAV_MASK)

#define PKC_PKC_ACCESS_ERR_APB_WRGMD_MASK        (0x2U)
#define PKC_PKC_ACCESS_ERR_APB_WRGMD_SHIFT       (1U)
/*! apb_wrgmd - APB Error: Wrong access mode */
#define PKC_PKC_ACCESS_ERR_APB_WRGMD(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_APB_WRGMD_SHIFT)) & PKC_PKC_ACCESS_ERR_APB_WRGMD_MASK)

#define PKC_PKC_ACCESS_ERR_RESERVED3_MASK        (0xCU)
#define PKC_PKC_ACCESS_ERR_RESERVED3_SHIFT       (2U)
/*! reserved3 - reserved for future erors on APB I/F */
#define PKC_PKC_ACCESS_ERR_RESERVED3(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_RESERVED3_SHIFT)) & PKC_PKC_ACCESS_ERR_RESERVED3_MASK)

#define PKC_PKC_ACCESS_ERR_APB_MASTER_MASK       (0xF0U)
#define PKC_PKC_ACCESS_ERR_APB_MASTER_SHIFT      (4U)
/*! apb_master - APB Master that triggered first APB error (APB_WRGMD or APB_NOTAV) */
#define PKC_PKC_ACCESS_ERR_APB_MASTER(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_APB_MASTER_SHIFT)) & PKC_PKC_ACCESS_ERR_APB_MASTER_MASK)

#define PKC_PKC_ACCESS_ERR_RESERVED9_MASK        (0x300U)
#define PKC_PKC_ACCESS_ERR_RESERVED9_SHIFT       (8U)
/*! reserved9 - reserved for future erors on AHB I/F Layer2 Only */
#define PKC_PKC_ACCESS_ERR_RESERVED9(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_RESERVED9_SHIFT)) & PKC_PKC_ACCESS_ERR_RESERVED9_MASK)

#define PKC_PKC_ACCESS_ERR_AHB_MASK              (0x400U)
#define PKC_PKC_ACCESS_ERR_AHB_SHIFT             (10U)
/*! ahb - AHB Error: invalid AHB access Layer2 Only */
#define PKC_PKC_ACCESS_ERR_AHB(x)                (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_AHB_SHIFT)) & PKC_PKC_ACCESS_ERR_AHB_MASK)

#define PKC_PKC_ACCESS_ERR_RESERVED15_MASK       (0xF800U)
#define PKC_PKC_ACCESS_ERR_RESERVED15_SHIFT      (11U)
/*! reserved15 - reserved for future erors on AHB I/F Layer2 Only */
#define PKC_PKC_ACCESS_ERR_RESERVED15(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_RESERVED15_SHIFT)) & PKC_PKC_ACCESS_ERR_RESERVED15_MASK)

#define PKC_PKC_ACCESS_ERR_PKCC_MASK             (0x10000U)
#define PKC_PKC_ACCESS_ERR_PKCC_SHIFT            (16U)
/*! pkcc - Error in PKC coprocessor kernel */
#define PKC_PKC_ACCESS_ERR_PKCC(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_PKCC_SHIFT)) & PKC_PKC_ACCESS_ERR_PKCC_MASK)

#define PKC_PKC_ACCESS_ERR_FDET_MASK             (0x20000U)
#define PKC_PKC_ACCESS_ERR_FDET_SHIFT            (17U)
/*! fdet - Error due to error detection circuitry */
#define PKC_PKC_ACCESS_ERR_FDET(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_FDET_SHIFT)) & PKC_PKC_ACCESS_ERR_FDET_MASK)

#define PKC_PKC_ACCESS_ERR_CTRL_MASK             (0x40000U)
#define PKC_PKC_ACCESS_ERR_CTRL_SHIFT            (18U)
/*! ctrl - Error in PKC software control */
#define PKC_PKC_ACCESS_ERR_CTRL(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_CTRL_SHIFT)) & PKC_PKC_ACCESS_ERR_CTRL_MASK)

#define PKC_PKC_ACCESS_ERR_UCRC_MASK             (0x80000U)
#define PKC_PKC_ACCESS_ERR_UCRC_SHIFT            (19U)
/*! ucrc - Error in layer2 CRC check */
#define PKC_PKC_ACCESS_ERR_UCRC(x)               (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_UCRC_SHIFT)) & PKC_PKC_ACCESS_ERR_UCRC_MASK)

#define PKC_PKC_ACCESS_ERR_RESERVED20_MASK       (0x100000U)
#define PKC_PKC_ACCESS_ERR_RESERVED20_SHIFT      (20U)
/*! reserved20 - reserved */
#define PKC_PKC_ACCESS_ERR_RESERVED20(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_RESERVED20_SHIFT)) & PKC_PKC_ACCESS_ERR_RESERVED20_MASK)

#define PKC_PKC_ACCESS_ERR_RESERVED31_MASK       (0xFFE00000U)
#define PKC_PKC_ACCESS_ERR_RESERVED31_SHIFT      (21U)
/*! reserved31 - reserved for more block errors */
#define PKC_PKC_ACCESS_ERR_RESERVED31(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_RESERVED31_SHIFT)) & PKC_PKC_ACCESS_ERR_RESERVED31_MASK)
/*! @} */

/*! @name PKC_ACCESS_ERR_CLR - Clear Access Error */
/*! @{ */

#define PKC_PKC_ACCESS_ERR_CLR_ERR_CLR_MASK      (0x1U)
#define PKC_PKC_ACCESS_ERR_CLR_ERR_CLR_SHIFT     (0U)
/*! err_clr - Write 1 to reset PKC_ACCESS_ERR SFR. */
#define PKC_PKC_ACCESS_ERR_CLR_ERR_CLR(x)        (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_CLR_ERR_CLR_SHIFT)) & PKC_PKC_ACCESS_ERR_CLR_ERR_CLR_MASK)

