zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_PKC.h
#define PKC_PKC_ACCESS_ERR_CLR_RESERVED31_MASK   (0xFFFFFFFEU)
#define PKC_PKC_ACCESS_ERR_CLR_RESERVED31_SHIFT  (1U)
/*! reserved31 - reserved */
#define PKC_PKC_ACCESS_ERR_CLR_RESERVED31(x)     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_ACCESS_ERR_CLR_RESERVED31_SHIFT)) & PKC_PKC_ACCESS_ERR_CLR_RESERVED31_MASK)
/*! @} */

/*! @name PKC_INT_CLR_ENABLE - Interrupt enable clear */
/*! @{ */

#define PKC_PKC_INT_CLR_ENABLE_EN_PDONE_MASK     (0x1U)
#define PKC_PKC_INT_CLR_ENABLE_EN_PDONE_SHIFT    (0U)
/*! en_pdone - Write to clear PDONE interrupt enable flag (PKC_INT_ENABLE.EN_PDONE=0). */
#define PKC_PKC_INT_CLR_ENABLE_EN_PDONE(x)       (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_CLR_ENABLE_EN_PDONE_SHIFT)) & PKC_PKC_INT_CLR_ENABLE_EN_PDONE_MASK)

#define PKC_PKC_INT_CLR_ENABLE_RESERVED1_MASK    (0x2U)
#define PKC_PKC_INT_CLR_ENABLE_RESERVED1_SHIFT   (1U)
/*! reserved1 - reserved */
#define PKC_PKC_INT_CLR_ENABLE_RESERVED1(x)      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_CLR_ENABLE_RESERVED1_SHIFT)) & PKC_PKC_INT_CLR_ENABLE_RESERVED1_MASK)

#define PKC_PKC_INT_CLR_ENABLE_RESERVED31_MASK   (0xFFFFFFFCU)
#define PKC_PKC_INT_CLR_ENABLE_RESERVED31_SHIFT  (2U)
/*! reserved31 - reserved */
#define PKC_PKC_INT_CLR_ENABLE_RESERVED31(x)     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_CLR_ENABLE_RESERVED31_SHIFT)) & PKC_PKC_INT_CLR_ENABLE_RESERVED31_MASK)
/*! @} */

/*! @name PKC_INT_SET_ENABLE - Interrupt enable set */
/*! @{ */

#define PKC_PKC_INT_SET_ENABLE_EN_PDONE_MASK     (0x1U)
#define PKC_PKC_INT_SET_ENABLE_EN_PDONE_SHIFT    (0U)
/*! en_pdone - Write to set PDONE interrupt enable flag (PKC_INT_ENABLE.EN_PDONE=1). */
#define PKC_PKC_INT_SET_ENABLE_EN_PDONE(x)       (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_SET_ENABLE_EN_PDONE_SHIFT)) & PKC_PKC_INT_SET_ENABLE_EN_PDONE_MASK)

#define PKC_PKC_INT_SET_ENABLE_RESERVED1_MASK    (0x2U)
#define PKC_PKC_INT_SET_ENABLE_RESERVED1_SHIFT   (1U)
/*! reserved1 - reserved */
#define PKC_PKC_INT_SET_ENABLE_RESERVED1(x)      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_SET_ENABLE_RESERVED1_SHIFT)) & PKC_PKC_INT_SET_ENABLE_RESERVED1_MASK)

#define PKC_PKC_INT_SET_ENABLE_RESERVED31_MASK   (0xFFFFFFFCU)
#define PKC_PKC_INT_SET_ENABLE_RESERVED31_SHIFT  (2U)
/*! reserved31 - reserved */
#define PKC_PKC_INT_SET_ENABLE_RESERVED31(x)     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_SET_ENABLE_RESERVED31_SHIFT)) & PKC_PKC_INT_SET_ENABLE_RESERVED31_MASK)
/*! @} */

/*! @name PKC_INT_STATUS - Interrupt status */
/*! @{ */

#define PKC_PKC_INT_STATUS_INT_PDONE_MASK        (0x1U)
#define PKC_PKC_INT_STATUS_INT_PDONE_SHIFT       (0U)
/*! int_pdone - End-of-computation status flag: INT_PDONE is set after EACH single PKC layer0 or
 *    layer1 calculation. In case of a universal pointer calculation (layer2) INT_PDONE is set at the
 *    end of the pipe calculation when PKC_ULEN has been decremented to zero and the final PKC
 *    calculation has completed.
 */
#define PKC_PKC_INT_STATUS_INT_PDONE(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_STATUS_INT_PDONE_SHIFT)) & PKC_PKC_INT_STATUS_INT_PDONE_MASK)

#define PKC_PKC_INT_STATUS_RESERVED1_MASK        (0x2U)
#define PKC_PKC_INT_STATUS_RESERVED1_SHIFT       (1U)
/*! reserved1 - reserved */
#define PKC_PKC_INT_STATUS_RESERVED1(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_STATUS_RESERVED1_SHIFT)) & PKC_PKC_INT_STATUS_RESERVED1_MASK)

#define PKC_PKC_INT_STATUS_RESERVED31_MASK       (0xFFFFFFFCU)
#define PKC_PKC_INT_STATUS_RESERVED31_SHIFT      (2U)
/*! reserved31 - reserved */
#define PKC_PKC_INT_STATUS_RESERVED31(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_STATUS_RESERVED31_SHIFT)) & PKC_PKC_INT_STATUS_RESERVED31_MASK)
/*! @} */

/*! @name PKC_INT_ENABLE - Interrupt enable */
/*! @{ */

#define PKC_PKC_INT_ENABLE_EN_PDONE_MASK         (0x1U)
#define PKC_PKC_INT_ENABLE_EN_PDONE_SHIFT        (0U)
/*! en_pdone - PDONE interrupt enable flag: If EN_PDONE=1 an interrupt is triggered every time
 *    PKC_INT_STATUS.INT_PDONE is set. Otherwise the interrupt generation is suppressed.
 */
#define PKC_PKC_INT_ENABLE_EN_PDONE(x)           (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_ENABLE_EN_PDONE_SHIFT)) & PKC_PKC_INT_ENABLE_EN_PDONE_MASK)

#define PKC_PKC_INT_ENABLE_RESERVED1_MASK        (0x2U)
#define PKC_PKC_INT_ENABLE_RESERVED1_SHIFT       (1U)
/*! reserved1 - reserved */
#define PKC_PKC_INT_ENABLE_RESERVED1(x)          (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_ENABLE_RESERVED1_SHIFT)) & PKC_PKC_INT_ENABLE_RESERVED1_MASK)

#define PKC_PKC_INT_ENABLE_RESERVED31_MASK       (0xFFFFFFFCU)
#define PKC_PKC_INT_ENABLE_RESERVED31_SHIFT      (2U)
/*! reserved31 - reserved */
#define PKC_PKC_INT_ENABLE_RESERVED31(x)         (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_ENABLE_RESERVED31_SHIFT)) & PKC_PKC_INT_ENABLE_RESERVED31_MASK)
/*! @} */

/*! @name PKC_INT_CLR_STATUS - Interrupt status clear */
/*! @{ */

#define PKC_PKC_INT_CLR_STATUS_INT_PDONE_MASK    (0x1U)
#define PKC_PKC_INT_CLR_STATUS_INT_PDONE_SHIFT   (0U)
/*! int_pdone - Write to clear End-of-computation status flag (PKC_INT_STATUS.INT_PDONE=0). */
#define PKC_PKC_INT_CLR_STATUS_INT_PDONE(x)      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_CLR_STATUS_INT_PDONE_SHIFT)) & PKC_PKC_INT_CLR_STATUS_INT_PDONE_MASK)

#define PKC_PKC_INT_CLR_STATUS_RESERVED1_MASK    (0x2U)
#define PKC_PKC_INT_CLR_STATUS_RESERVED1_SHIFT   (1U)
/*! reserved1 - reserved */
#define PKC_PKC_INT_CLR_STATUS_RESERVED1(x)      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_CLR_STATUS_RESERVED1_SHIFT)) & PKC_PKC_INT_CLR_STATUS_RESERVED1_MASK)

#define PKC_PKC_INT_CLR_STATUS_RESERVED31_MASK   (0xFFFFFFFCU)
#define PKC_PKC_INT_CLR_STATUS_RESERVED31_SHIFT  (2U)
/*! reserved31 - reserved */
#define PKC_PKC_INT_CLR_STATUS_RESERVED31(x)     (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_CLR_STATUS_RESERVED31_SHIFT)) & PKC_PKC_INT_CLR_STATUS_RESERVED31_MASK)
/*! @} */

/*! @name PKC_INT_SET_STATUS - Interrupt status set */
/*! @{ */

#define PKC_PKC_INT_SET_STATUS_INT_PDONE_MASK    (0x1U)
#define PKC_PKC_INT_SET_STATUS_INT_PDONE_SHIFT   (0U)
/*! int_pdone - Write to set End-of-computation status flag (PKC_INT_STATUS.INT_PDONE=1) to trigger
 *    a PKC interrupt via software, e.g. for debug purposes.
 */
#define PKC_PKC_INT_SET_STATUS_INT_PDONE(x)      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_SET_STATUS_INT_PDONE_SHIFT)) & PKC_PKC_INT_SET_STATUS_INT_PDONE_MASK)

#define PKC_PKC_INT_SET_STATUS_RESERVED1_MASK    (0x2U)
#define PKC_PKC_INT_SET_STATUS_RESERVED1_SHIFT   (1U)
/*! reserved1 - reserved */
#define PKC_PKC_INT_SET_STATUS_RESERVED1(x)      (((uint32_t)(((uint32_t)(x)) << PKC_PKC_INT_SET_STATUS_RESERVED1_SHIFT)) & PKC_PKC_INT_SET_STATUS_RESERVED1_MASK)

